tap "homebrew/services"
brew "biome"
brew "chezmoi"
brew "fish"
brew "gemini-cli"
brew "gh"
brew "powerlevel10k"
brew "starship"
brew "tree"
cask "claude-code"
cask "codex"
cask "font-maple-mono-nf-cn"
cask "font-maple-mono-nl-nf-cn"
cask "macfuse"
cask "mos"
cask "orbstack"
cask "raycast"
cask "secretive"
cask "warp"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alibaba-cloud.tongyi-lingma"
vscode "antfu.file-nesting"
vscode "antfu.iconify"
vscode "antfu.icons-carbon"
vscode "antfu.smart-clicks"
vscode "antfu.theme-vitesse"
vscode "antfu.unocss"
vscode "anthropic.claude-code"
vscode "be5invis.vscode-custom-css"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "codeium.codeium"
vscode "cweijan.vscode-database-client2"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "ddiu8081.moegi-theme"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "foxundermoon.shell-format"
vscode "funkyremi.vscode-google-translate"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "heybourn.headwind"
vscode "intellsmi.comment-translate"
vscode "jaaxxx.bun-lockb"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "kamikillerto.vscode-colorize"
vscode "kingwl.vscode-vitest-runner"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "ldez.ignore-files"
vscode "lokalise.i18n-ally"
vscode "marscode.marscode-extension"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "openai.chatgpt"
vscode "oven.bun-vscode"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rubiin.nestjs"
vscode "rvest.vs-code-prettier-eslint"
vscode "shardulm94.trailing-spaces"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
