# ========================================
# Homebrew 包管理配置
# ========================================
# 管理方式: chezmoi 模板，根据机器角色自动适配
# 使用 is_server 变量区分服务器和客户端配置
# ========================================

# ========================================
# Formulas - 命令行工具
# ========================================

# 核心工具
brew "chezmoi"                # Dotfiles 管理工具
brew "tree"                   # 目录树查看工具

# 开发工具
brew "biome"                  # Web 项目格式化和检查工具
brew "gh"                     # GitHub CLI 命令行工具

# Shell 增强
brew "powerlevel10k"          # Zsh 主题（用于 .p10k.zsh 配置）

# 现代化 CLI 工具（替代传统 Unix 命令）
brew "eza"                    # ls 替代 - Git 集成、图标、彩色输出
brew "bat"                    # cat 替代 - 语法高亮、行号
brew "ripgrep"                # grep 替代 - 10-100x 速度提升
brew "fd"                     # find 替代 - 简洁语法、并行搜索
brew "zoxide"                 # cd 增强 - 智能跳转、频率记忆
brew "git-delta"              # diff 替代 - 语法高亮、Git 集成
brew "btop"                   # top 替代 - 精美 TUI、全面监控
brew "dust"                   # du 替代 - 可视化图表
brew "duf"                    # df 替代 - 彩色表格
brew "procs"                  # ps 替代 - 彩色输出、树形视图
brew "tealdeer"               # man 补充 - 简明示例
brew "sd"                     # sed 替代 - 简化语法
brew "xh"                     # curl 替代 - HTTPie 语法
brew "tokei"                  # cloc 替代 - 代码统计
brew "hyperfine"              # time 替代 - 基准测试

# ========================================
# Casks - 应用程序（所有机器共用）
# ========================================

# 开发工具
cask "claude-code"            # Claude Code 编辑器
cask "codex"                  # 代码片段管理工具

# 字体
cask "font-maple-mono-nf-cn"     # Maple Mono 字体（Nerd Font 中文支持）
cask "font-maple-mono-nl-nf-cn"  # Maple Mono 无连字版本（Nerd Font 中文支持）

# 系统工具
cask "mos"                    # 鼠标增强工具（平滑滚动）
cask "raycast"                # 效率启动器（Spotlight 替代品）

# 容器与虚拟化
cask "orbstack"               # Docker/Linux 虚拟机

# 终端与 SSH
cask "secretive"              # SSH 密钥管理（使用 Secure Enclave）
cask "warp"                   # Warp 终端

# ========================================
# 服务器特有配置
# ========================================
{{- if .is_server }}
cask "macfuse"                # 文件系统挂载工具（SSHFS、NTFS 等）
{{- end }}
