tap "homebrew/services"
brew "biome"
brew "chezmoi"
brew "gh"
brew "powerlevel10k"
brew "tree"
cask "claude-code"
cask "codex"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-maple-mono-nl-nf-cn"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "macfuse"
cask "mos"
cask "orbstack"
cask "secretive"
cask "warp"
